const icon = document.getElementById("myIcon");

// Додаємо обробник події для відстеження події "наведення" на кнопці
icon.addEventListener("mouseenter", function() {
  // Змінюємо колір іконки на білий при наведенні
  icon.style.fill = "white";
});

// Додаємо обробник події для відстеження події "зняття наведення" з кнопки
icon.addEventListener("mouseleave", function() {
  // Змінюємо колір іконки на чорний при знятті наведення
  icon.style.fill = "black";
});
// З цим JavaScript-кодом колір іконки буде змінюватися на білий при наведенні і повертатися до чорного при знятті наведення. Ви можете впорядкувати і налаштувати цей код згідно з вашими потребами.





